{"class_name": "Model", "config": {"name": "model_28", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 26, 500], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "bidirectional_1", "class_name": "Bidirectional", "config": {"name": "bidirectional_1", "trainable": true, "layer": {"class_name": "RecurrentSequential", "config": {"cells": [{"class_name": "LSTMCell", "config": {"activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "output_dim": 500, "name": "lstm_cell_1", "trainable": true, "batch_input_shape": [null, 500], "dtype": "float32"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.0, "noise_shape": null, "seed": null}}, {"class_name": "LSTMCell", "config": {"activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "output_dim": 500, "name": "lstm_cell_2", "trainable": true}}], "decode": false, "output_length": null, "readout": false, "teacher_force": false, "return_states": false, "state_sync": false, "state_initializer": null, "readout_activation": "linear", "name": "forward_recurrent_sequential_1", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0}}, "merge_mode": "sum"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "private__optional_input_place_holder_1", "class_name": "_OptionalInputPlaceHolder", "config": {"name": "private__optional_input_place_holder_1", "trainable": true, "batch_input_shape": [2], "dtype": "float32"}, "inbound_nodes": []}, {"name": "private__optional_input_place_holder_2", "class_name": "_OptionalInputPlaceHolder", "config": {"name": "private__optional_input_place_holder_2", "trainable": true, "batch_input_shape": [2], "dtype": "float32"}, "inbound_nodes": []}, {"name": "private__optional_input_place_holder_3", "class_name": "_OptionalInputPlaceHolder", "config": {"name": "private__optional_input_place_holder_3", "trainable": true, "batch_input_shape": [2], "dtype": "float32"}, "inbound_nodes": []}, {"name": "private__optional_input_place_holder_4", "class_name": "_OptionalInputPlaceHolder", "config": {"name": "private__optional_input_place_holder_4", "trainable": true, "batch_input_shape": [2], "dtype": "float32"}, "inbound_nodes": []}, {"name": "recurrent_sequential_2", "class_name": "RecurrentSequential", "config": {"cells": [{"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "batch_input_shape": [null, 26, 500], "dtype": "float32", "rate": 0.0, "noise_shape": null, "seed": null}}, {"class_name": "AttentionDecoderCell", "config": {"hidden_dim": 500, "output_dim": 500, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "name": "attention_decoder_cell_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.0, "noise_shape": null, "seed": null}}, {"class_name": "LSTMDecoderCell", "config": {"hidden_dim": 500, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "output_dim": 500, "name": "lstm_decoder_cell_1", "trainable": true}}], "decode": true, "output_length": 26, "readout": false, "teacher_force": false, "return_states": false, "state_sync": false, "state_initializer": null, "readout_activation": "linear", "name": "recurrent_sequential_2", "trainable": true, "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "implementation": 0}, "inbound_nodes": [[["bidirectional_1", 0, 0, {}], ["private__optional_input_place_holder_1", 0, 0, {}], ["private__optional_input_place_holder_2", 0, 0, {}], ["private__optional_input_place_holder_3", 0, 0, {}], ["private__optional_input_place_holder_4", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["recurrent_sequential_2", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}